tsung_tools/lookup_stepwise.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="warning">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="30000000"/>
  </clients>

  <servers>
    <server host="lo-okup.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="minute">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="minute">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="minute">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="minute">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="10" unit="minute">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="10" unit="minute">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="10" unit="minute">
      <users arrivalrate="256" unit="second"/>
    </arrivalphase>
  </load>

  <sessions>
      <session name="es_load" weight="1" type="ts_http">
         <request>
            <http url="/" method="GET"/>
         </request>
      </session>
   </sessions>
</tsung>